var lda = require('./lib/lda');
var perplexity_lda = require('./lib/perplexity_lda');

var sentences = [
  'คอมพิวเตอร์ เทคโนโลยี่ โลก แสดงผล',
  'โลก ต้นไม้ ธรรมชาติ ลำธาร เทคโนโลยี่ ทำลาย',
  'เทคโนโลยี่ โลก ธรรมมะ หลุดพ้น ดับทุกข์',
  'คอมพิวเตอร์ เทคโนโลยี่ โลก แสดงผล',
  'โลก ต้นไม้ ธรรมชาติ ลำธาร เทคโนโลยี่ ทำลาย',
  'เทคโนโลยี่ โลก ธรรมมะ หลุดพ้น ดับทุกข์',
  'คอมพิวเตอร์ เทคโนโลยี่ โลก แสดงผล',
  'โลก ต้นไม้ ธรรมชาติ ลำธาร เทคโนโลยี่ ทำลาย',
  'เทคโนโลยี่ โลก ธรรมมะ หลุดพ้น ดับทุกข์',
  'คอมพิวเตอร์ เทคโนโลยี่ โลก แสดงผล',
  'โลก ต้นไม้ ธรรมชาติ ลำธาร เทคโนโลยี่ ทำลาย',
  'เทคโนโลยี่ โลก ธรรมมะ หลุดพ้น ดับทุกข์',
  'คอมพิวเตอร์ เทคโนโลยี่ โลก แสดงผล',
  'โลก ต้นไม้ ธรรมชาติ ลำธาร เทคโนโลยี่ ทำลาย',
  'เทคโนโลยี่ โลก ธรรมมะ หลุดพ้น ดับทุกข์',
];

var result = lda('direct', sentences, 3, 3, ['th']);

console.log(JSON.stringify(result));
result.printReadableOutput();

var perplexity = perplexity_lda(result.topicModel, sentences, ['th']);
console.log('Perplexity = '+perplexity);
